Repository: Cybernisk/djtp
Catalog: docs/locale/*/LC_MESSAGES/accounts.po
Languages: ru

source: Forms
ru: Формы

source: An account forms.
ru: Формы приложения accounts.

source: depends on RequestModelForm
ru: зависит от RequestModelForm

source: Increase brute force iteration value if form is invalid
ru: Увеличивает brute force iteration, если форма была заполнена не верно

source: is_valid statement (True or False)
ru: is_valid состояние (True или False)

source: Save brute force iteration value
ru: Сохраняет значение brute force iteration

source: saves form instance, True by default
ru: сохраняет экземпляр формы (класса), по умолчанию True

source: form instance
ru: экземпляр формы

source: Login Form
ru: Форма для входа

source: Password Change Initiation Form
ru: Форма смены пароля

source: Password Restore Form
ru: Форма восстановления пароля

source: Password Restore Initiation Form
ru: Форма начала восстановления пароля (инициирования восстановления)

source: Models
ru: Модели

source: Base class implementing a fully featured User model with admin-compliant permissions.
ru: Базовый класс, предоставляющий полную User модель с админ-совместимой системой прав.

source: Username, password and email are required. Other fields are optional.
ru: Имя пользователя, пароль и email - обязательные поля. Остальные - опциональны

source: returns change password url
ru: возвращает url смены пароля

source: Returns the first_name plus the last_name, with a space in between.
ru: Возвращает first_name и last_name с пробелом по средине.

source: returns profile url
ru: возвращает url профиля

source: returns recover password url
ru: возвращает url восстановления пароля

source: Returns the short name for the user.
ru: возвращает короткое имя пользователя.

source: UserSID class for security hashes store, uses for password recover process
ru: UserSID класс предназначен для сохранения ключей безопасности, используется в процессе восстановления пароля

source: Views
ru: Представления

source: Class based views
ru: Представления, основанные на классах

source: An account classed based views.
ru: Представления, основанные на классах accounts приложения

source: LoginView
ru: Представление входа

source: LogoutView
ru: Представление выхода

source: Password Change View
ru: Представление смены пароля

source: Password Restore Initiate View
ru: Представление инициации процедуры восстановления пароля

source: Password Restore View
ru: Представление восстановления пароля

source: Profile View
ru: Представление профиля

source: JSON views
ru: JSON представления

source: JSON module
ru: JSON модуль

source: Returns users serialized within json
ru: Возвращает список пользователей сериализованных в json

source: dict or queryset or model instance
ru: dict или queryset или экземпляр модели

source: Signals
ru: Сигналы

source: user pre save signal
ru: сигнал пред-сохранения (pre-save)
