Repository: Cybernisk/djtp
Catalog: docs/locale/*/LC_MESSAGES/core.po
Languages: ru

source: Forms
ru: Формы

source: RequestFormMixin, store Django ``request`` instance in self.request
ru: RequestFormMixin, кладет экземпляр Django ``request`` в self.request

source: ``request`` instance should be given via keywords while form instance init
ru: экземпляр ``request`` должен быть задан через keywords параметры при инициализации экземпляра формы

source: RequestModelForm, bases on ``forms.ModelForm`` class use RequestFormMixin instead of it
ru: RequestModelForm, основан на классе ``forms.ModelForm``, используйте RequestFormMixin вместо него

source: Views
ru: Представления

source: Index view
ru: Стартовое представление

source: JSON View Mixin
ru: Миксин JSON представления

source: convert context instance to json string
ru: конвертирует экземпляр контекста в json строку

source: context instance (``dict``)
ru: экземпляр контекста (``dict``))

source: ``unicode`` string , json formatted
ru: ``unicode`` строка, json совместимая

source: Calls delete() method on the fetched object and then redirects to the success URL.
ru: Вызывает delete() метод для объекта, после осуществляет редирект к success URL.

source: form_valid method
ru: метод form_valid

source: context instance
ru: экземпляр контекста

source: response kwargs instance
ru: экземпляр response kwargs

source: ``response`` object with ``content_type='application/json'``
ru: ``response`` объект с ``content_type='application/json'``

source: LoginRequired View Mixin
ru: Миксин LoginRequired представление

source: Helpers
ru: Помощники

source: Helpers.
ru: Помощники.

source: Gets content_type for ``Object``. Works with ModelBase based classes, its instances and with format string ``'app_label.model_name'``, also supports django-sphinx models and instances modification retrieves content_type or raise the common django Exception
ru: Получает content_type для ``Object``. Работает с классами, основанными на ModelBase, экземплярами этих классов и с форматированной строкой вида ``'app_label.model_name'``. Также поддерживает django-sphinx модели и их экземпляры. Получает content_type или поднимает стандартное Django исключение (Exception)

source: ``ContentType`` instance
ru: экземпляр ``ContentType``

source: Model class, instance, basestring classpath instance
ru: Класс Model, экземпляр классов Model, форматированная строка

source: Gets ``Object`` content_type or raises Http404
ru: Получает ``Object`` content_type или поднимает исключение Http404

source: Gets ``Object`` content_type or returns None
ru: Получает ``Object`` content_type или None

source: ``ContentType`` instance or None
ru: экземпляр ``ContentType`` или None

source: Get object or raise Http404 if it does not exist
ru: Получает объект или поднимает исключение Http404, если объекта не существует

source: ``Object`` instance
ru: экземпляр ``Object``

source: Get ``Object`` instance or None
ru: Получает экземпляр ``Object`` или None

source: Model class or basestring classpath instance
ru: класс Model или форматированная строка

source: queryset options for ``Object``
ru: queryset опции для ``Object``

source: render decorator, takes different types of instances to HttpResponse object instance.
ru: декторатор рендера, получает различные типы экземпляров и производит рендер в объект HttpResponse

source: deprecated, use classed based views instead of ``@render_to``
ru: deprecated, используйте представления, основанные на классах вместо ``@render_to``

source: False, allows to use ``HttpResponse`` with ``content_type='application/json'`` as return object instance
ru: False, позволяет использовать ``HttpResponse`` вместе с ``content_type='application/json'`` как результат для ответа

source: ``'text/html'`` by default, sets content_type for ``HttpResponse`` object instance.
ru: по умолчанию ``'text/html'``, устанавливает content_type для экземпляра класса ``HttpResponse``.

source: ``HttpResponse`` instance
ru: экземпляр класса ``HttpResponse``

source: Returns HttpResponse as json document
ru: Возвращает HttpResponse как json документ

source: content_type, for example ``application/json``
ru: content_type, например ``application/json``

source: HttpResponse with given content_type
ru: HttpResponse с переданным content_type

source: Shortcuts
ru: Сокращения

source: return response object
ru: возвращает объект ответа сервера (response)

source: Django ``HttpRequest`` instance
ru: экземпляр класса Django ``HttpRequest``

source: template file place on filesystem and stored in template directory ex. ``'accounts/profile.html'``
ru: месторасположения файла шаблона на файловой системе, хранимой в директории шаблонов, например ``'accounts/profile.html'``

source: ``dict`` instance with render context ``{'context': True, 'time': datetime.now()}``
ru: экземпляр ``dict`` для рендера ``{'context: Truem 'time': datetime.now()}``

source: context processors
ru: контекстные процессоры

source: ``HttpResponse`` object instance
ru: Экземпляр класса ``HttpResponse``

source: Decorators
ru: Дектораторы

source: login_required_json decorator, returns HttpResponse with ``content_type='application/json'`` object
ru: декторатор login_required_json, возвращает объект HttpResponse вместе с типом ``content_type='application/json'``

source: ``HttpResponse`` with ``'application/json'`` content_type.
ru: ``HttpResponse`` c ``'application/json'`` content_type'ом.

source: Sets ``{"success": False}`` if user is not logged in
ru: Устанавливает ``{"success: False}``, если пользователь не выполнил вход в систему

source: Context Processors
ru: Контекстные процессоры

source: Context processors
ru: Контекстные процессоры

source: global_referer context processor
ru: контекстный процессор global_referer

source: current_referer sets to current URI (HTTP_HOST + PATH_INFO) global_referer sets to HTTP_REFERER
ru: current_referer содержит текущий URI (HTTP_HOST + PATH_INFO) global_referer устанавливает HTTP_REFERER

source: current_referer sets to current URI (HTTP_HOST + PATH_INFO)
ru: current_referer содержит текущий URI (HTTP_HOST + PATH_INFO)

source: global_referer sets to HTTP_REFERER
ru: global_referer содержит HTTP_REFERER

source: global settings context processor
ru: контекстный процессор глобальных настроек

source: gs as django.conf.settings object get_full_path as ``request.get_full_path()`` instance current_date as ``timezone.now()``
ru: gs - объект django.conf.settings get_full_path - экземпляр ``request.get_full_path()`` current_date - ``timezone.now()``

source: gs as django.conf.settings object
ru: gs - объект django.conf.settings

source: get_full_path as ``request.get_full_path()`` instance
ru: get_full_path - экземпляр ``request.get_full_path()``

source: current_date as ``timezone.now()``
ru: current_date - ``timezone.now()``

source: session context processor
ru: контекстный процессор сессии

source: session as ``request.session`` instance
ru: session - экземпляр ``request.session``

source: template context processor
ru: контекстный процессор темплейта

source: base as ``settings.DEFAULT_TEMPLATE``
ru: base - ``settings.DEFAULT_TEMPLATE``
