Repository: Cybernisk/djtp
Catalog: docs/locale/*/LC_MESSAGES/install.po
Languages: ru

source: Installation
ru: Установка

source: Dependecies
ru: Зависимости

source: List of whole dependencies split into backend and frontend ones. But before start you should install of check your list for this software:
ru: Список полных зависимостей разбит на backend и frontend. Прежде чем начать вы должны установить/проверить следующий список программного обеспечения:

source: *requirements list*
ru: *список требований*

source: nodejs-0.10.x with npm
ru: nodejs-0.10.x с npm

source: psycopg2 for PostgreSQL databases connection
ru: psycopg2 для соединения с базами данных на PostgreSQL

source: python-mysql for MySQL/MariaDB
ru: python-mysql для соединения с базами данных на MySQL/MariaDB

source: *optional*
ru: *опциональные зависимости*

source: python-virtualenv or pip
ru: python-virtualenv или pip

source: Backend dependencies
ru: Backend зависимости

source: Backend store as pip requirement file, placed in ``requirements/base.txt`` folder. You can install using:
ru: Backend зависимости сохранены как файл зависимостей pip, расположенный в ``requirements/base.txt`` каталоге. Вы можете установить их используя:

source: for automatic installation or install listed packages by yourself.
ru: для автоматической инсталляции, также вы можете установить этот список сами.

source: ``requirements/docs.txt`` contains dependence list for building documents for this project. It's not required for the proper run or work, so it could be treat as additional package deps.
ru: ``requirements/docs.txt`` содержит список зависимостей для построения данного документа и всей документации проекта. Данные зависимости не являются обязательными для правильной работы проекта, так что они могут быть проигнорированы в установке.

source: Frontent dependencies
ru: Frontend зависимости

source: Nodejs ``bower`` had been chosen as frontend dependecies package manager. So you can install it via ``npm install -g bower`` and install frontend dep list:
ru: ``bower`` на Nodejs был выбран в качестве пакетного менеджера для frontend зависимостей. Вы можете установить его используя ``npm install -g bower``, после этого вы можете установить список frontend зависимостей:

source: Configuration
ru: Конфигурация

source: **Step 1** You should tune up you database connection, store you settings into the ``settings/local.py`` file, for example::
ru: **Шаг 1** Вы должны сконфигурировать настройки для соединения с базой данных, сохранить их в файле настроек ``settings/local.py``, например::

source: or leave default settings which use sqlite engine.
ru: или оставить настройки по умолчанию, которые используют sqlite.

source: **Step 2** run ``./manage.py syncdb --migrate`` script from the top level of your project:
ru: **Шаг 2** запустите ``./manage.py syncdb --migrate`` из корневой директории вашего проекта:
