Repository: Cybernisk/djtp
Catalog: docs/locale/*/LC_MESSAGES/jsonapp.po
Languages: ru

source: Puropse
ru: Предназначение

source: Json app serves as proxy for url scheme and url namespaces already created applications.
ru: Json app служит прокси для url схемы и url неймспейса для уже созданных приложений.

source: Usage
ru: Использование

source: Contents of ``apps/json/urls.py``:
ru: Содержание ``apps/json/urls.py``

source: Mean application accounts use separate url schema and path for json only request/responses.
ru: Обозначает, что приложение accounts использует отдельную url схему и url неймспейс для json-only запросов/ответов.

source: **URL-schema usage**:
ru: **Использование URL-схемы**

source: Full cycle example
ru: Полный пример

source: Lets add some view for serialize get now for given timezone serialized in json and put it into the core application.
ru: Давайте добавим файл представления для сериализации текущего времени для указанной таймзоны в json формате и сохраним его в приложении core.

source: **Step 1**
ru: **Шаг 1**

source: Create json view for serving our future jsons request/responses in any editor/ide you like and put it in ``apps/core``.
ru: Создайте представление json для обработки будущих json запрос/ответов (представлений) и любом редакторе и сохраните его в ``apps/core``.

source: Example:``apps/core/json_views.py``
ru: Пример: ``apps/core/json_views.py``

source: **Step 2**
ru: **Шаг 2**

source: Create separate url schema for its view in ``apps/core/json_urls.py``. You can assign any name you like for json urls file.
ru: Создайте отдельный документ url-схемы для созданного представления в ``apps/core/json_urls``. Вы можете выбрать любое имя для файла, которое вам нравится.

source: Example:``apps/core/json_urls.py``
ru: Например: ``apps/core/json_urls.py``

source: **Step 3**
ru: **Шаг 3**

source: Include created schemas to jsonapp urls
ru: Подключите созданные схемы в jsonapp urls

source: Now we can fully use created ``timezone_now`` view via separate json url schema:
ru: Теперь мы можем использовать представление ``timezone_now`` через отдельную url схему json:
